'use strict';

module.exports = {
  users: [{
    name: `Евгений Смирнов`,
    email: `evgen2002@ya.ru`,
    avatar: `/img/avatar01.jpg`,
    password: `123456`,
  }, {
    name: `Василий Уткин`,
    email: `vas12121@ya.ru`,
    avatar: `/img/avatar02.jpg`,
    password: `123456`,
  }],
  categories: [
    `Разное`,
    `Политика`,
    `IT`
  ],
  offers: [{
    authorId: 1,
    category: [1, 2, 3],
    description: `При покупке с меня бесплатная доставка в черте города. Две страницы заляпаны свежим кофе. Пользовались бережно и только по большим праздникам., Бонусом отдам все аксессуары.`,
    picture: `item03.jpg`,
    title: `Продам новую приставку Sony Playstation 5.`,
    sum: 42698,
    type: `offer`
  }, {
    authorId: 1,
    category: [1, 2, 3],
    description: `Отдам в хорошие руки подшивку «Мурзилка».`,
    picture: `item03.jpg`,
    title: `Продам новую приставку Sony Playstation 5.`,
    sum: 42698,
    type: `offer`
  }, {
    authorId: 1,
    category: [1, 2, 3],
    description: `Куплю антиквариат.`,
    picture: `item03.jpg`,
    title: `Продам отличную подборку фильмов на VHS.`,
    sum: 42698,
    type: `offer`
  } * /, / * {
    authorId: 1,
    category: [1, 2, 3],
    description: `При покупке с меня бесплатная доставка в черте города. Две страницы заляпаны свежим кофе. Пользовались бережно и только по большим праздникам., Бонусом отдам все аксессуары.`,
    picture: `item03.jpg`,
    title: `Продам коллекцию журналов «Огонёк».`,
    sum: 42698,
    type: `offer`
  }, {
    authorId: 1,
    category: [1, 2, 3],
    description: `При покупке с меня бесплатная доставка в черте города. Две страницы заляпаны свежим кофе. Пользовались бережно и только по большим праздникам., Бонусом отдам все аксессуары.`,
    picture: `item03.jpg`,
    title: `Продам советскую посуду. Почти не разбита.`,
    sum: 42698,
    type: `offer`
  }, {
    authorId: 1,
    category: [1, 2, 3],
    description: `При покупке с меня бесплатная доставка в черте города. Две страницы заляпаны свежим кофе. Пользовались бережно и только по большим праздникам., Бонусом отдам все аксессуары.`,
    picture: `item03.jpg`,
    title: `Продам книги Стивена Кинга.`,
    sum: 42698,
    type: `offer`
  }]
};
